###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/abefb416-d6b5-41fd-9927-90e035d443a5/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.ansibleinstance[0] has changed
  ~ resource "aws_instance" "ansibleinstance" {
        id                                   = "i-0d26dc440e566ee77"
      ~ security_groups                      = [
          - "sg-0ec4cbd2e16f765a6",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-AnsibleVM-3"
            "Owner" = "Group10"
        }
        # (29 unchanged attributes hidden)







      ~ root_block_device {
          + tags                  = {}
            # (9 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }

  # aws_instance.ansibleinstance[1] has changed
  ~ resource "aws_instance" "ansibleinstance" {
        id                                   = "i-0c45380fb1710734d"
      ~ security_groups                      = [
          - "sg-0ec4cbd2e16f765a6",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-AnsibleVM-4"
            "Owner" = "Group10"
        }
        # (29 unchanged attributes hidden)







      ~ root_block_device {
          + tags                  = {}
            # (9 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }

  # aws_instance.bastion[0] has changed
  ~ resource "aws_instance" "bastion" {
        id                                   = "i-03a581c98ee13c4f8"
      ~ security_groups                      = [
          - "sg-0043e500cee2dacde",
        ]
        tags                                 = {
            "Name" = "prod-Bastion-1"
        }
        # (30 unchanged attributes hidden)







      ~ root_block_device {
          + tags                  = {}
            # (9 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }

  # aws_instance.privateinstance[0] has changed
  ~ resource "aws_instance" "privateinstance" {
        id                                   = "i-0dcb1e2d60e6d9691"
      ~ security_groups                      = [
          - "sg-01db37fc898c7eb8a",
        ]
        tags                                 = {
            "Name" = "prod-PrivateVM-1"
        }
        # (28 unchanged attributes hidden)







      ~ root_block_device {
          + tags                  = {}
            # (9 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }

  # aws_instance.privateinstance[1] has changed
  ~ resource "aws_instance" "privateinstance" {
        id                                   = "i-093418f96a5095817"
      ~ security_groups                      = [
          - "sg-01db37fc898c7eb8a",
        ]
        tags                                 = {
            "Name" = "prod-PrivateVM-2"
        }
        # (28 unchanged attributes hidden)







      ~ root_block_device {
          + tags                  = {}
            # (9 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }

  # aws_instance.tfinstance[0] has changed
  ~ resource "aws_instance" "tfinstance" {
        id                                   = "i-0ab3336b0b9ac4ec1"
      ~ security_groups                      = [
          - "sg-0ec4cbd2e16f765a6",
        ]
        tags                                 = {
            "Name" = "prod-TFVM-1"
        }
        # (30 unchanged attributes hidden)







      ~ root_block_device {
          + tags                  = {}
            # (9 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }

  # aws_key_pair.projetkey has changed
  ~ resource "aws_key_pair" "projetkey" {
        id          = "projectkey"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.bastionSG has changed
  ~ resource "aws_security_group" "bastionSG" {
        id                     = "sg-0043e500cee2dacde"
        name                   = "allow_http_ssh_bastion"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.privateSG has changed
  ~ resource "aws_security_group" "privateSG" {
        id                     = "sg-01db37fc898c7eb8a"
        name                   = "allow_http_ssh_private"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.publicSG has changed
  ~ resource "aws_security_group" "publicSG" {
        id                     = "sg-0ec4cbd2e16f765a6"
        name                   = "allow_http_ssh_public"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_instance.ansibleinstance[0] must be replaced
+/- resource "aws_instance" "ansibleinstance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0d26dc440e566ee77" -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0d26dc440e566ee77" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0fceff0ca8299fc1a" -> (known after apply)
      ~ private_dns                          = "ip-10-1-3-138.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.3.138" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.234.254.69" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0ec4cbd2e16f765a6",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-AnsibleVM-3"
            "Owner" = "Group10"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-056c5656a962c5512" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_instance.ansibleinstance[1] must be replaced
+/- resource "aws_instance" "ansibleinstance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0c45380fb1710734d" -> (known after apply)
      ~ availability_zone                    = "us-east-1d" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0c45380fb1710734d" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0e43d987a2e7aff9c" -> (known after apply)
      ~ private_dns                          = "ip-10-1-4-21.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.4.21" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "44.202.251.70" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0ec4cbd2e16f765a6",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-AnsibleVM-4"
            "Owner" = "Group10"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0ab6dfe1d2914893c" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_instance.bastion[0] must be replaced
+/- resource "aws_instance" "bastion" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-03a581c98ee13c4f8" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-03a581c98ee13c4f8" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0f879502c669d622d" -> (known after apply)
      ~ private_dns                          = "ip-10-1-2-60.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.2.60" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.91.51.243" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0043e500cee2dacde",
        ]
        tags                                 = {
            "Name" = "prod-Bastion-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0043e500cee2dacde",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0ddeeda3aad8e7808" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_instance.privateinstance[0] must be replaced
+/- resource "aws_instance" "privateinstance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0dcb1e2d60e6d9691" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0dcb1e2d60e6d9691" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-05c711f160ef8b886" -> (known after apply)
      ~ private_dns                          = "ip-10-1-5-183.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.5.183" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-01db37fc898c7eb8a",
        ]
        tags                                 = {
            "Name" = "prod-PrivateVM-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-01db37fc898c7eb8a",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0f2a0fd72f0c66c7c" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_instance.privateinstance[1] must be replaced
+/- resource "aws_instance" "privateinstance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-093418f96a5095817" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-093418f96a5095817" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-04cf7552a074524f1" -> (known after apply)
      ~ private_dns                          = "ip-10-1-6-249.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.6.249" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-01db37fc898c7eb8a",
        ]
        tags                                 = {
            "Name" = "prod-PrivateVM-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-01db37fc898c7eb8a",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0d0263bac962c8009" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_instance.tfinstance[0] must be replaced
+/- resource "aws_instance" "tfinstance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0ab3336b0b9ac4ec1" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0ab3336b0b9ac4ec1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0591532ea5d058848" -> (known after apply)
      ~ private_dns                          = "ip-10-1-1-176.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.1.176" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "54.221.3.60" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0ec4cbd2e16f765a6",
        ]
        tags                                 = {
            "Name" = "prod-TFVM-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0cba570e80773bdf4" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 6 to add, 0 to change, 6 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.ansibleinstance[0] has changed%0A  ~ resource "aws_instance" "ansibleinstance" {%0A        id                                   = "i-0d26dc440e566ee77"%0A      ~ security_groups                      = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-AnsibleVM-3"%0A            "Owner" = "Group10"%0A        }%0A        # (29 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A      ~ root_block_device {%0A          + tags                  = {}%0A            # (9 unchanged attributes hidden)%0A        }%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.ansibleinstance[1] has changed%0A  ~ resource "aws_instance" "ansibleinstance" {%0A        id                                   = "i-0c45380fb1710734d"%0A      ~ security_groups                      = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-AnsibleVM-4"%0A            "Owner" = "Group10"%0A        }%0A        # (29 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A      ~ root_block_device {%0A          + tags                  = {}%0A            # (9 unchanged attributes hidden)%0A        }%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.bastion[0] has changed%0A  ~ resource "aws_instance" "bastion" {%0A        id                                   = "i-03a581c98ee13c4f8"%0A      ~ security_groups                      = [%0A          - "sg-0043e500cee2dacde",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-Bastion-1"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A      ~ root_block_device {%0A          + tags                  = {}%0A            # (9 unchanged attributes hidden)%0A        }%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.privateinstance[0] has changed%0A  ~ resource "aws_instance" "privateinstance" {%0A        id                                   = "i-0dcb1e2d60e6d9691"%0A      ~ security_groups                      = [%0A          - "sg-01db37fc898c7eb8a",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-PrivateVM-1"%0A        }%0A        # (28 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A      ~ root_block_device {%0A          + tags                  = {}%0A            # (9 unchanged attributes hidden)%0A        }%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.privateinstance[1] has changed%0A  ~ resource "aws_instance" "privateinstance" {%0A        id                                   = "i-093418f96a5095817"%0A      ~ security_groups                      = [%0A          - "sg-01db37fc898c7eb8a",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-PrivateVM-2"%0A        }%0A        # (28 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A      ~ root_block_device {%0A          + tags                  = {}%0A            # (9 unchanged attributes hidden)%0A        }%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.tfinstance[0] has changed%0A  ~ resource "aws_instance" "tfinstance" {%0A        id                                   = "i-0ab3336b0b9ac4ec1"%0A      ~ security_groups                      = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-TFVM-1"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A      ~ root_block_device {%0A          + tags                  = {}%0A            # (9 unchanged attributes hidden)%0A        }%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # aws_key_pair.projetkey has changed%0A  ~ resource "aws_key_pair" "projetkey" {%0A        id          = "projectkey"%0A      + tags        = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.bastionSG has changed%0A  ~ resource "aws_security_group" "bastionSG" {%0A        id                     = "sg-0043e500cee2dacde"%0A        name                   = "allow_http_ssh_bastion"%0A      + tags                   = {}%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.privateSG has changed%0A  ~ resource "aws_security_group" "privateSG" {%0A        id                     = "sg-01db37fc898c7eb8a"%0A        name                   = "allow_http_ssh_private"%0A      + tags                   = {}%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.publicSG has changed%0A  ~ resource "aws_security_group" "publicSG" {%0A        id                     = "sg-0ec4cbd2e16f765a6"%0A        name                   = "allow_http_ssh_public"%0A      + tags                   = {}%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.ansibleinstance[0] must be replaced%0A+/- resource "aws_instance" "ansibleinstance" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0d26dc440e566ee77" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1c" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-0d26dc440e566ee77" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      ~ primary_network_interface_id         = "eni-0fceff0ca8299fc1a" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-3-138.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.3.138" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "3.234.254.69" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0ec4cbd2e16f765a6",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-AnsibleVM-3"%0A            "Owner" = "Group10"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)%0A          - tags                  = {} -> null%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-056c5656a962c5512" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A            # (2 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # aws_instance.ansibleinstance[1] must be replaced%0A+/- resource "aws_instance" "ansibleinstance" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0c45380fb1710734d" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1d" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-0c45380fb1710734d" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      ~ primary_network_interface_id         = "eni-0e43d987a2e7aff9c" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-4-21.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.4.21" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "44.202.251.70" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0ec4cbd2e16f765a6",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-AnsibleVM-4"%0A            "Owner" = "Group10"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)%0A          - tags                  = {} -> null%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-0ab6dfe1d2914893c" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A            # (2 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # aws_instance.bastion[0] must be replaced%0A+/- resource "aws_instance" "bastion" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-03a581c98ee13c4f8" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1b" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-03a581c98ee13c4f8" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      ~ primary_network_interface_id         = "eni-0f879502c669d622d" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-2-60.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.2.60" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "3.91.51.243" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0043e500cee2dacde",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-Bastion-1"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0043e500cee2dacde",%0A        ] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)%0A          - tags                  = {} -> null%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-0ddeeda3aad8e7808" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A            # (2 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[0] must be replaced%0A+/- resource "aws_instance" "privateinstance" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0dcb1e2d60e6d9691" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1a" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-0dcb1e2d60e6d9691" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      ~ primary_network_interface_id         = "eni-05c711f160ef8b886" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-5-183.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.5.183" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known
  ```
  </details>
  *Pusher: @dkhan0103, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*